# Эта программа определяет ваш музыкальный вкус
print("Какого известного исполнителя вы слушаете?")
print("(Face, Rauf&Faik, Imagine Dragons, Nirvana, Queen, Ольга Бузова, Баста,")
print("Элджей, Литвиненко, Баста, Тима Белорусских, Артур Пирожков, Егор Крид, Oxxxymiron")
print("Би-2, Тимати, Киркоров, Николай Басков, Боб Марли, Майкл Джэксон, Слава КПСС)")
n = str(input())

if n == "Face":
    print("Извините, у вас нет вкуса")
elif n == "Ольга Бузова":
    print("Никому не говорите, чтобы продолжать общаться с людьми")
elif n == "Баста":
    print("У вас превосходный слух")
elif n == "Тима Белорусских":
    print("Вы случайно не девочка 13-ти лет?")
elif n == "Артур Пирожков":
    print("Такое чувство, что вам медведь наступил на ухо")
elif n == "Литвиненко":
    print("ОП МУСОРОК НЕ ШЕЙ МНЕ СРОК...")
elif n == "Элджей":
    print("Закройте программу и больше не открывайте её")
elif n == "Макс Корж":
    print("Поздравляю, вы один из немногих нормальных людей")
elif n == "БИ-2":
    print("Вы - ценитель")
elif n == "Imagine Dragons":
    print("Есть вероятность, что если включить их песню, то вы её не узнаете")
elif n == "Rauf&Faik":
    print("Вы близки ко дну")
elif n == "Lizer":
    print("Вы близки к людям, которые слушают Face")
elif n == "Хлеб":
    print("Вы приколист ;)")
elif n == "Егор Крид":
    print("Советую вам никому не говорить о своих музыкальных вкусах")
elif n == "Тимати":
    print("Сходите к врачу, проконсультируйтесь")
elif n == "Киркоров":
    print("Навека...")
elif n == "Николай Басков":
    print("Без комментариев...Зачем вообще мой создатель добавил его?..")
elif n == "Майкл Джэксон":
    print("Вы человек, который ценит настоящее искусство")
elif n == "Queen":
    print("Отличный выбор!")
elif n == "Nirvana":
    print("С этой группой вы точно достигните Нирваны")
elif n == "Боб Марли":
    print("Правильный выбор")
elif n == "Слава КПСС":
    print("Поздравляю! Ваш IQ 37! Вы лютый!")
elif n == "Oxxxymiron":
    print("Неплохоой выбор!")